sql/URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "submitter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "http://www.appacademy.io"], ["short_url", "CvT_AAbwLHWTilmrOyvFog"], ["submitter_id", 2], ["created_at", "2020-03-19 13:19:21.645626"], ["updated_at", "2020-03-19 13:19:21.645626"]]
---
  def self.create_for_user_and_long_url!(user, long_url)

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "CvT_AAbwLHWTilmrOyvFog"], ["LIMIT", 1]]
---
  def self.random_code
    loop do
      random_code = SecureRandom.urlsafe_base64(16)
      return random_code unless ShortenedUrl.exists?(short_url: random_code)